combat_options = [
    "思维矫正", "朝谒", "魂灵朝谒", "授法", "不容拒绝",
    "信号灯", "劫虚济实", "鸭速公路", "玩具的报复", "战场侧面",  
    "大棋一盘", "溃乱魔典", "火力小队", "机动队", "猩红甬道", 
    "混沌", "神出鬼没", "争议频发", "通道封锁", "寄人城池下",
    "计划耕种", "建制", "莱茵卫士", "谋求共识", "神圣的渴求",
    "外道", "洞天福地", "或然面纱", "奉献", "斩首", "王冠之下", "离歌的庭院", "赴敌者"
]

combat_options_score = {
    "思维矫正": 100,
    "朝谒": 150,
    "魂灵朝谒": 240,
    "授法": 450,  
    "不容拒绝": 500, 
    "信号灯": 30, 
    "劫虚济实": 50, 
    "鸭速公路": 100,
    "玩具的报复": 30,
    "大棋一盘": 20,
    "火力小队": 30,
    "猩红甬道": 50,
    "神出鬼没": 100,
    "通道封锁": 50,
    "计划耕种": 100,
    "莱茵卫士": 150,
    "神圣的渴求": 100,
    "洞天福地": 200,
    "溃乱魔典": 30,
    "机动队": 30,
    "混沌": 80,
    "争议频发": 120,
    "寄人城池下": 100,
    "建制": 150,
    "谋求共识": 100,
    "外道": 150,
    "或然面纱": 40,
    "斩首": 40,
    "离歌的庭院": 50,
    "奉献": 40,
    "王冠之下": 40,
    "赴敌者": 50,
    "战场侧面": 100
}

combat_options_extra_score = {
    "授法": 150,
    "不容拒绝": 150,
}
